<?php

namespace Database\Seeders;

use App\Models\MenuItem;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class MenuSeed extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        /*Про управління*/
        $this->addMenuItem("Про управління", "/item-1", null); //  1
        $this->addMenuItem("Про Головне управління", "/item-1", 1); //  2
        $this->addMenuItem("Структура", "/item-1", 1); // 3
        $this->addMenuItem("Розпорядок роботи", "/item-1", 1); // 4
        $this->addMenuItem("Профспілкова організація", "/item-1", 1); // 5
        $this->addMenuItem("Колективний договір", "/item-1", 5); // 6
        $this->addMenuItem("Бланк заяви для вступу", "/item-1", 5); // 7
        $this->addMenuItem("Кадрова політика", "/item-1", 1); // 8
        $this->addMenuItem("Вакансії", "/item-1", 8); // 9
        $this->addMenuItem("Конкурс - вакансії", "/item-1", 8); // 10
        $this->addMenuItem("Зразки документів", "/item-1", 8); // 11
        $this->addMenuItem("Інформація про втрачені посвідчення", "/item-1", 8); // 12
        $this->addMenuItem("Результати конкурсів", "/item-1", 8); // 13
        $this->addMenuItem("Очищення влади", "/item-1", 1); // 14
        $this->addMenuItem("Державні установи (лабораторії, лікарні) ветеринарної медицини", "/item-1", 1); // 15
        $this->addMenuItem("Вартість послуг", "/item-1", 15); // 16
        $this->addMenuItem("Кіровоградська регіональна державна
лабораторія ветеринарної медицини", "/item-1", 1); // 17
        /*Діяльність*/
        $this->addMenuItem("Діяльність", "/item-1", null); // 18
        $this->addMenuItem("Суб'єктам господарювання", "/item-1", 18); // 19
        $this->addMenuItem("Декларації малих виробництв виноробної продукції", "/item-1", 19); // 20
        $this->addMenuItem("Внутрішній аудит", "/item-1", 18); // 21
        $this->addMenuItem("Планування діяльності", "/item-1", 21); // 22
        $this->addMenuItem("Оперативний план діяльності Держпродспоживслужби
з внутрішнього аудиту на 2020 рік", "/item-1", 22); // 23
        $this->addMenuItem("Стратегічний план діяльності Держпродспоживслужби
         з внутрішнього аудиту на 2019 - 2021 роки (із змінами)", "/item-1", 22); // 24
        $this->addMenuItem("План діяльності з внутрішнього аудиту в
        Держпродспоживслужби та її територіальних
        органах на ІІ півріччя 2018 року", "/item-1", 22); // 25
        $this->addMenuItem("Основні напрямки діяльності", "/item-1", 21); // 26
        $this->addMenuItem("Декларація внутрішнього аудиту", "/item-1", 26); // 27
        $this->addMenuItem("Перелік нормативно-правових актів", "/item-1", 21); // 28
        $this->addMenuItem("Оцінювання службової діяльності посадових осіб", "/item-1", null); // 29
        $this->addMenuItem("Закупівлі", "/item-1", 18); // 30
        $this->addMenuItem("Плани та звіти про виконання", "/item-1", 18); // 31
        $this->addMenuItem("Система енергетичного менеджменту", "/item-1", 18); // 32
        /*Публічна інформація*/
        $this->addMenuItem("Публічна інформація", "/item-1", null); // 33
        $this->addMenuItem("Перелік відомостей, що містить службову інформацію", "/item-1", 33); // 34
        $this->addMenuItem("Інформація про використання бюджетних коштів", "/item-1", 33); // 35
        $this->addMenuItem("Про стан розгляду запитів на публічну інформацію", "/item-1", 33); // 36
        $this->addMenuItem("Доступ до публічної інформації", "/item-1", 33); // 37
        $this->addMenuItem("Нормативно-правова база", "/item-1", 37); // 38
        $this->addMenuItem("Форма запиту на публічну інформацію", "/item-1", 37); // 39
        /*Зв'язки з громадськістю*/
        $this->addMenuItem("Зв'язки з громадськістю", "/item-1", null); // 40
        $this->addMenuItem("Суб'єктам господарювання", "/item-1", 40); // 41
        $this->addMenuItem("Залишити звернення", "/item-1", 40); // 42
        $this->addMenuItem("Аналіз звернень громадян", "/item-1", 40); // 43
        /*СТОП корупція*/
        $this->addMenuItem("СТОП корупція", "/item-1", null); // 44
        $this->addMenuItem("Запобігання проявам корупції", "/item-1", 44); // 45
        $this->addMenuItem("Нормативно-правова база", "/item-1", 44); // 46
        $this->addMenuItem("Планування діяльності", "/item-1", 44); // 47
        $this->addMenuItem("Декларування", "/item-1", 44); // 48
        $this->addMenuItem("Повідом про корупцію", "/item-1", 44); // 49
        /*У воєнний час*/
        $this->addMenuItem("У воєнний час", "/item-1", null); // 50
        /*Напрямки*/
        $this->addMenuItem("Напрямки", "/item-1", null); // 51
        $this->addMenuItem("Контроль за цінами", "/item-1", 51); // 52
        $this->addMenuItem("В умовах воєнного стану", "/item-1", 52); // 53
        $this->addMenuItem("Заходи щодо стабілізації цін (COVID-19)", "/item-1", 52); // 54
        $this->addMenuItem("Основні напрямки діяльністі", "/item-1", 52); // 55
        $this->addMenuItem("Державний контроль за регульованими цінами", "/item-1", 52); // 56
        $this->addMenuItem("Актуальна інформація", "/item-1", 52); // 57
        $this->addMenuItem("Фітосанітарна безпека, насінництво та розсадництво", "/item-1", 51); // 58
        $this->addMenuItem("Основні напрямки діяльності", "/item-1", 58); // 59
        $this->addMenuItem("Пам'ятки", "/item-1", 58); // 60
        $this->addMenuItem("Перелік нормативно-правових актів", "/item-1", 58); // 61
        $this->addMenuItem("Довідники", "/item-1", 58); // 62
        $this->addMenuItem("Наказ перелік регульованих шкідливих організмів", "/item-1", 62); // 63
        $this->addMenuItem("Переліки шкідливих організмів А1 та А2 ЄОКЗР", "/item-1", 62); // 64
        $this->addMenuItem("Фітосанітарний моніторинг і прогноз", "/item-1", 58); // 65
        $this->addMenuItem("Фітосанітарні вимоги країн імпортерів", "/item-1", 58); // 66
        $this->addMenuItem("Адміністративні послуги", "/item-1", 58); // 67
        $this->addMenuItem("Перелік тестових питань та варіанти відповідей
        для проходження тестування осіб, діяльність яких пов’язана з транспортуванням,
        зберіганням, застосуванням, торгівлею пестицидами", "/item-1", 58); // 68
        $this->addMenuItem("Фітосанітарний стан області", "/item-1", 58); // 69
        $this->addMenuItem("Розпорядження про запровадження
         або скасування карантинного режиму, у тому числі переліку територій,
         на яких запроваджено карантинний режим", "/item-1", 58); // 70
        $this->addMenuItem("Бланки фітосанітарних документів та заяв", "/item-1", 58); // 71
        $this->addMenuItem("Заява на оформлення фітосанітарного сертифіката,
        фітосанітарного сертифіката на реекспорт, карантинного сертифіката", "/item-1", 71); // 72
        $this->addMenuItem("Заява на обстеження КНР", "/item-1", 71); // 73
        $this->addMenuItem("Фітосанітарний сертифікат", "/item-1", 71); // 74
        $this->addMenuItem("Заява про встановлення статусу вільних ділянок", "/item-1", 71); // 75
        $this->addMenuItem("Карантинний сертифікат", "/item-1", 71); // 76
        $this->addMenuItem("Заява про проведення перевірки та реєстрацію особи", "/item-1", 71); // 77
        $this->addMenuItem("Заява на проведення фітосанітарних процедур", "/item-1", 71); // 78
        $this->addMenuItem("Рекомендації щодо торгівлі насінням", "/item-1", 58); // 79
        $this->addMenuItem("Перелік лабораторій з визначення посівних якостей насіння", "/item-1", 58); // 80
        $this->addMenuItem("Харчові продукти та ветеринарна медицина", "/item-1", 51); // 81
        $this->addMenuItem("Основні напрямки діяльності", "/item-1", 81); // 82
        $this->addMenuItem("Перелік нормативно-правових актів", "/item-1", 81); // 83
        $this->addMenuItem("Пам'ятки", "/item-1", 81); // 84
        $this->addMenuItem("Реєстри", "/item-1", 81); // 85
        $this->addMenuItem("Заява про державну реєстрацію потужності з додатком", "/item-1", 85); // 86
        $this->addMenuItem("Звіти", "/item-1", 81); // 87
        $this->addMenuItem("Рішення щодо вжитих заходів за результатами державного нагляду", "/item-1", 81); // 88
        $this->addMenuItem("Повідомлення", "/item-1", 81); // 89
        $this->addMenuItem("Адміністративні послуги", "/item-1", 81); // 90
        $this->addMenuItem("Повідомлення системи швидкого оповіщення
        щодо харчових продуктів та кормів RASFF", "/item-1", 81); // 91
        $this->addMenuItem("Санітарно-епідеміологічний нагляд", "/item-1", 51); // 92
        $this->addMenuItem("Основні напрямки діяльності", "/item-1", 92); // 93
        $this->addMenuItem("Державний нагляд (контроль)", "/item-1", 92); // 94
        $this->addMenuItem("Перелік нормативно-правових актів", "/item-1", 92); // 95
        $this->addMenuItem("Адміністративні послуги", "/item-1", 92); // 96
        $this->addMenuItem("Матеріали семінарів", "/item-1", 92); // 97
        $this->addMenuItem("Пам'ятки", "/item-1", 92); // 98
        $this->addMenuItem("Актуальна інформація щодо проведення державної
        санітарно-епідеміологічної експертизи", "/item-1", 92); // 99
        $this->addMenuItem("Захист прав споживачів", "/item-1", 51); // 100
        $this->addMenuItem("Анонси", "/item-1", 100); // 101
        $this->addMenuItem("Консультаційний центр", "/item-1", 100); // 102
        $this->addMenuItem("Основні напрямки діяльності", "/item-1", 100); // 103
        $this->addMenuItem("Державний нагляд (контроль)", "/item-1", 100); // 104
        $this->addMenuItem("Перелік нормативно-правових актів", "/item-1", 100); // 105
        $this->addMenuItem("Бланки заяв", "/item-1", 100); // 106
        $this->addMenuItem("Судова практика", "/item-1", 100); // 107
        $this->addMenuItem("Ринковий нагляд", "/item-1", 100); // 108
        $this->addMenuItem("Щодо здійснення державного ринкового нагляду", "/item-1", 108); // 109
        $this->addMenuItem("Перелік нормативно-правових актів", "/item-1", 108); // 110
        $this->addMenuItem("Пам'ятки", "/item-1", 108); // 111
        $this->addMenuItem("Технічний регламент", "/item-1", 108); // 112
        $this->addMenuItem("Метрологічний нагляд", "/item-1", 100); // 113
        $this->addMenuItem("Презентаційний звіт управління захисту споживачів", "/item-1", 100); // 114
        $this->addMenuItem("Реєстрація сільськогосподарської техніки", "/item-1", 51); // 115
        $this->addMenuItem("Перелік нормативно-правових актів", "/item-1", 115); // 116
        $this->addMenuItem("Прийом документів", "/item-1", 115); // 117
        $this->addMenuItem("Новини", "/item-1", 115); // 118
    }

    private function addMenuItem($title, $url, $parent_id)
    {
        $slug = Str::slug($title, '_'); // Генерація слага

        MenuItem::create([
            'title' => $title,
            'url' => '/'.$slug, // Додаємо слаг до урлу
            'parent_id' => $parent_id,
            'page_type'=>'post',
            'created_at'=> now(),
            'updated_at' => now()
        ]);
    }
}
